1、 Android 屏幕分辨率统计
---
![屏幕分辨率统计.png](http://upload-images.jianshu.io/upload_images/1239900-1c2d31c8ca1aeee1.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)

    几个说明：
     * 以上数据来自[友盟统计](http://www.umindex.com/devices/android_resolutions),2015.12月份的数据
     * 1184x720 以及 1776x1080 的屏幕分辨率实际上是1280x720 和 1920x1080 ；他们的系统使用了虚拟按键 ，导致了可显示区域的减少；
     * 综合一下市场上面的主流设备就是1280x720,1920x1080,854x480,800x480,960x540;
     * 如果要进行屏幕适配，我们要采用根据分辨率进行适配？

2、根据屏幕宽度的适配
---
    Android 不止提供了根据分辨率的适配规则 ，也提供了屏幕宽度限定进行的适配方式；
    使用w-Ndp 方式限定资源，可以在一套配置中适配多个分辨率；

    1280x720 分辨率的手机，相对屏幕密度是2，把单位换算成dp后，屏幕尺寸变为640x360dp ；
    960x540 分辨率的手机，相对屏幕密度是1.5，把单位换算成dp后，屏幕尺寸变为640x360dp ；
    1920x1080 分辨率的手机，相对屏幕密度是3，把单位换算成dp后，屏幕尺寸变为640x360dp ；
    在res下新建values-w360dp，就能适配到以上配置的手机了；

    854x480，800x480分辨率的手机，通常是宽度通常是320dp ，放置在values-w360dp下面就可以适配到了。

3、 几个但是
---
    但是，鉴于Android本身的开放性，各个厂商都没有能够很好的做到一致性，比如说三星的手机有1280x800的设备，相对密度为2，于是需要添加values-w400dp的文件夹；
    但是，1280x720 手机的相对密度可能是1.5的，可能是3的，于是还可能需要适配w480dp，w240dp ；
    但是，960x540  手机的相对密度可能是1的，可能是2的，于是还可能需要适配w540dp，w270dp ；
    但是，1920x1080 手机的相对密度可能是2的，于是还可能需要适配w540dp；
    **代码中，请采用dp作为单位**
#4、最后
---
资源路径下的样子就是这样的了：

![资源文件.png](http://upload-images.jianshu.io/upload_images/1239900-21cb28477f803a23.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)
